app/controllers/users_controller.rb

  def show
    if params[:user] and params[:user][:name]
      @user = User.find_by_name(params[:user][:name])
    else
      @user = User.find(params[:id])
---
SELECT * FROM "users" WHERE ("users"."name" = 'Alex Rothenberg') LIMIT 1
SELECT * FROM "users" WHERE ("users"."id" = 1)

  def create
    @user = User.new(params[:user])

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("name", "updated_at", "address", "created_at") VALUES('Pat S', '2009-05-06 15:33:59', '456', '2009-05-06 15:33:59')